microresearch/allcolours/SR_segments/software/stm32f4xx_it_draftdec.c
int32_t oldValue, integrator, k, bt;

void TIM2_IRQHandler(void) // running with period=1024, prescale=32 at 2KHz - how fast can we run this?
// period 32, prescaler 8 = toggle of 104 KHz
// 4 and 4 we go up to 800 KHz
{
  uint32_t lengthbit=15, new_stat, prob;
  uint32_t x, y, q, start=0;
  uint32_t bitn=0, bitnn, bitnnn, bitnnnn, bitrr, tmp, tmp2, tmpp, xx;
  uint32_t trigger[4]={0,0,0,0};
  static uint32_t flipd[4]={0,0,0,0}, flipper[4]={1}, w=0, count=0;
  static uint32_t counter[7]={0,0,0,0,0,0,0};  // last counter is for fake clks
  static uint32_t which[4]={0,0,0,0};
  static uint32_t tug[4]={0,0,0,0};
  static uint32_t orde;

  
  int32_t tmpt, dacpar=0, adcpar=0;
  
  TIM_ClearITPendingBit(TIM2, TIM_IT_Update); // needed

  // crash detect ++ 32/64 in main.c is 14KHz //and/or speed check...
  //    flipper^=1;
  //  if (param[0]>4090){
  //    if (flipper) GPIOB->BSRRH = (1)<<12;  // clear bits PB12 - left normed clock I think
  //    else   GPIOB->BSRRL=(1)<<12; //  write bits   
  //  }

    /* // we don't deal with CLKs now!  
    //TODO: ghostSRs for normed clks (with speed of these from what, from RDAC?)
  if (w==2 && counter[2]>speed[w] && speedfrom[2]==1){ // 2 is Cspeed - but we have a problem when Cspeed is from an interrupt as this is never generated...FIXED HERE
      counter[2]=0;
      flipper^=1;
      if (flipper) GPIOB->BSRRH = clk_route[clkr];  // clear bits of fake_one - clkr is 7 so all of them
      // or we can set L and R from an independent SR with only CSR as clocked from here
      else   GPIOB->BSRRL=clk_route[clkr]; //  write bits       
    }
  */

  // for the time between counts
  counter_[0]++;  counter_[1]++;  counter_[2]++;  counter_[3]++;
  
  w++;
  if (w>3) {
    w=0;
  }

  if (intflag[w]) { // process INT
    trigger[w]=1;
    intflag[w]=0;
    clksr_[w]=(clksr_[w]<<1)+1;     // shift on to CLKSR
  }
  else  {
    trigger[w]=0;
    clksr_[w]=(clksr_[w]<<1);
  }
  // genericLFSR for all probability modes
  tmp= ((LFSR_[w] >> 31) ^ (LFSR_[w] >> 29) ^ (LFSR_[w] >> 25) ^ (LFSR_[w] >> 24)) & 1u; // 32 is 31, 29, 25, 24
  LFSR_[w] = (LFSR_[w]<<1) + tmp;
  
  counter[w]++;

  //  mode[w]=testmodes[w]; // TESTY!
  if (mode[w]>19)  mode[w]=19;
  // trial ADCs 0-17 for now
  //  mode[0]=1; 
  //  mode[3]=0; 

  switch(mode[w]){
    // for ADC in we just have/no route in!
  case 0: // for all just pass through - ADC NONE/pass, LR pass, DAC 0/pass
    if (counter[w]>speed[w] && speed[w]!=1024){
    dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC_
    dactype[2]=0;
    GSHIFT;
    if (w==0){// ADC just IN no route in
      bitn=ADC_(0,SRlength[0],0,trigger[0],reggg,adcpar);
    }
    BINROUTE;
    if (LR[w]){
      PULSIN_XOR;
    }
    
      // maybe lose this or not - is useful if we need no feed through but to run SR
    if (w==3){    // R hand side set GSR to 0 so no pass thru - but then we need extra w==3 mode to pass through
      // live with it as we have the leaky pulse in
      Gshift_[3][0]=0; // so we never feed back in from 3 to anywhere but can use the pulses still
      Gshift_[3][1]=0;
      Gshift_[3][2]=0;
      Gshift_[3][3]=0;
      }

    BITN_AND_OUT;
    }
    break;

  case 1: // just cycle  - ADC NONE/and route in - where to place this as is confusing and if we have 0/0R nothing happens
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC_
      dactype[2]=0;
      GSHIFT;
      if (w==0){
	BINROUTE;
      }
      else JUSTCYCLE;
      if (LR[w]) {
	PULSIN_XOR;
      }
      BITN_AND_OUT;
    }
    break;
    
    // 2-15 will be most important ADC/DAC modes and basics/global routes/prob modes etc.
    //- adcpar modes: 24(len), 25(len), 26(comp), 28(prob), 29(len), 30(lengthforosc), 31 (lengthforosc)
    //- REGG modes: 2/lfsr, 4/lfsr, 5/lfsr. 6/DACX. 11/lfsr, 12/lfsr, 13/lfsr, 19/dac, 27/lfsr, 
    /*
      Basic modes:
      2- cycle and route 
      3 pass on //leaks_pulsin - where we could decide on logop without multiplying modes
      4 cycles/pass //leakpuls

      5 00 1-TM invert cycling bit - OR with BITIN (OR (routed^pulse)) // OR (routedORpulse) ??
      6 01 2-BITIN or loopback
      7 10 3-INV of above
      8 11 4- BITIN or not into cycling

      9 4 probs with SR<DAC// choose dac - dac is opposing dac or always 3 except for itself? LFSR[]
      [or these can be toggles - TEST!
      10
      11
      12

      proto for SR>DAC is: 

//      if ((LFSR_[w] & 4095 ) < (shift_[LFSR[w]] & 4095)) or 
//      if ((LFSR_[w] & 4095 ) < dac[LFSR[w]]) // as that is 12 bits and shifted already - TRIAL this

    */
    
  case 2: // start to draft first set of ADC and DAC modes 
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC
      ADCDACETC1(1, 1); // ADCETC has GSHIFT - we start DAC at 1 as we had 0 above
      if (LR[w]){
      BINROUTEANDCYCLE; 
      PULSIN_XOR;
      }
      BITN_AND_OUT;
    }
  break;
  
  case 3: 
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=2048; adcpar=param[0]; reggg=0; // params - reggg is for ADC - dacpar for betaf one bit filter
      ADCDACETC1(2, 2); // ADCETC has GSHIFT
      if (LR[w]){
      BINROUTE;
      prob=shift_[w]&31; // this seems to work somehow 8/12/2021
      PULSIN_LEAK; // try xor vs leak vs or... - uses prob as param
      }
       if (w==3){    // R hand side set GSR to 0 so no pass thru - but then we need extra w==3 mode to pass through
      Gshift_[3][0]=0;
      Gshift_[3][1]=0;
      Gshift_[3][2]=0;
      Gshift_[3][3]=0;
      }


      BITN_AND_OUT;
    }
  break;

  case 4: 
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC
      ADCDACETC1(3, 3); // ADCETC has GSHIFT
      if (LR[w]){
      BINROUTEANDCYCLE;
      prob=shift_[w]&31; // this seems to work somehow 8/12/2021
      PULSIN_LEAK; // try xor vs leak vs or... - uses prob as param
      } 
      BITN_AND_OUT;
    }
    break;

  case 5: 
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC
      ADCDACETC1(4, 4); // ADCETC has GSHIFT
      if (LR[w]){ 	//00 1-TM invert cycling bit - OR with BITIN (OR (routed^pulse)) // OR (routedORpulse) 
	BINROUTE;
	if (trigger[w])	  bitrr=(shift_[w]>>SRlength[w]) & 0x01;
	else bitrr=!((shift_[w]>>SRlength[w]) & 0x01); 
	bitn|=bitrr;
	PULSIN_XOR;
      } // LR!
      BITN_AND_OUT;
    }
    break;
    
