microresearch/allcolours/SR_segments/software/stm32f4xx_it_draftdec.c
case 6: 
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC
      ADCDACETC1(5, 5); // ADCETC has GSHIFT
      if (LR[w]){ 	//	01 2-BITIN or loopback
	if (trigger[w]){
	  BINROUTE;
	}
	else {
	  bitn=(shift_[w]>>SRlength[w]) & 0x01; 
	}	
	PULSIN_XOR;
    } 
    BITN_AND_OUT;
  }
  break;

  case 7:
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC
      ADCDACETC1(6, 6); // ADCETC has GSHIFT
      if (LR[w]){ 	//10 3-INV of above
	if (trigger[w]){
	  BINROUTE;
	}
	else {
	  bitn=!(shift_[w]>>SRlength[w]) & 0x01; 
	}	
	PULSIN_XOR;
    } 
    BITN_AND_OUT;
  }
  break;

  case 8: 
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=0; adcpar=param[0]; reggg=3; // params - reggg is for ADC  - here is 3 for previous DAC
      ADCDACETC1(7, 7); // ADCETC has GSHIFT
      if (LR[w]){ //11 4- BITIN or not into cycling
	if (trigger[w]) tug[w]^=1;
	if (tug[w]){
	  BINROUTEANDCYCLE;
	}
	else {
	  bitn=(shift_[w]>>SRlength[w]) & 0x01; 
	}	
	PULSIN_XOR;
      } 
      BITN_AND_OUT;
  }
    break;

  case 9: 
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC
      ADCDACETC1(8, 8); // ADCETC has GSHIFT
      if (LR[w]){ 
	//
	PULSIN_XOR;
    } 
    BITN_AND_OUT;
  }
  break;

  /*
X3 strobe advances/freezes GHOST
X5 strobe reverses ghost - can also reverse own SR
6 strobe XOR shift with ghost???
  */
  
case 10:
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC
      ADCDACETC1(9, 9); // ADCETC has GSHIFT
      if (LR[w]){
      tmp=binroute[count][w];
      for (x=0;x<4;x++){
	if (tmp&0x01){
	  bitrr = (Gshift_[x][w]>>SRlength[x]) & 0x01;
	  if (trigger[w]) Gshift_[x][w]=(Gshift_[x][w]<<1)+bitrr; 
	  bitn^=bitrr;
	}
	tmp=tmp>>1;
      }
	PULSIN_XOR;
      }
    BITN_AND_OUT;
  }
  break;

  case 11: 
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC
      ADCDACETC1(10, 10); // ADCETC has GSHIFT
      if (LR[w]){ 
	      tmp=binroute[count][w];
      for (x=0;x<4;x++){
	if (tmp&0x01){
	  if (trigger[w]){
	    tmpp=Gshift_[x][w];
	    REV32; // reverse 32 bits
	    tmpp=tmpp&othermasky[SRlength[x]]; // mask the top length bits
	    Gshift_[x][w]=tmpp>>(31-SRlength[x]); // and shift 31-length bits
	  }
	  bitrr = (Gshift_[x][w]>>SRlength[x]) & 0x01;
	  Gshift_[x][w]=(Gshift_[x][w]<<1)+bitrr; // 
	  bitn^=bitrr;
	}
	tmp=tmp>>1;
      }
	PULSIN_XOR;
    } 
    BITN_AND_OUT;
  }
  break;

case 12: 
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=param[2]; adcpar=param[0]; reggg=0; // params - reggg is for ADC
      ADCDACETC1(11, 12); // ADCETC has GSHIFT - DAC loses case 11
      if (LR[w]){
      // XX - we XOR on STROBE our shift with the GHOST
  tmp=binroute[count][w];
  for (x=0;x<4;x++){
  if (tmp&0x01){
    if (trigger[w]) Gshift_[x][w]^=shift_[w];
    bitrr = (Gshift_[x][w]>>SRlength[x]) & 0x01;
    if (trigger[w]) 
      Gshift_[x][w]=(Gshift_[x][w]<<1)+bitrr;
    bitn^=bitrr;
  }
  tmp=tmp>>1;
  }
	PULSIN_XOR;
      } 
    BITN_AND_OUT;
  }
  break;

  ///////////////LR modes free for all from here 13->31
  //13/14/15 until we repeat DACs so what makes most sense for next 3
  
  case 13: 
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=param[2]; adcpar=param[0]; reggg=0; // params - reggg is for ADC
      ADCDACETC1(12, 13); // ADCETC has GSHIFT
      if (LR[w]){//00 1-TM invert cycling bit - OR with BITIN (OR (routed^pulse)) // OR (routedORpulse) ?? -- 9 below
	BINROUTE;
	if (((LFSR_[w] & 4095 ) < dac[LFSR[w]])){
	  bitrr=(shift_[w]>>SRlength[w]) & 0x01;
	}
	else bitrr=!((shift_[w]>>SRlength[w]) & 0x01); 
	bitn|=bitrr;
    PULSIN_XOR;
      }
      BITN_AND_OUT;
    }
  break;
  
case 14: 
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=param[2]; adcpar=param[0]; reggg=0; // params - reggg is for ADC
      ADCDACETC1(13, 14); // ADCETC has GSHIFT
      if (LR[w]){	//	01 2-BITIN or loopback
	if (((LFSR_[w] & 4095 ) < dac[LFSR[w]])){
	  BINROUTE;
	}
	else {
	  bitn=(shift_[w]>>SRlength[w]) & 0x01; 
	}		//
	PULSIN_XOR;
      }//LR
    BITN_AND_OUT;
  }
  break;

case 15: 
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=4095-(param[2]&4095); adcpar=param[0]; reggg=0; // params - reggg is for ADC
      ADCDACETC1(14, 2); // ADCETC has GSHIFT - is DAC 2 again but with param for filter!
      if (LR[w]){ // 11 mode //11 4- BITIN or not into cycling
	if (((LFSR_[w] & 4095 ) < dac[LFSR[w]])){
	  BINROUTEANDCYCLE;
	}
	else {
	  bitn=(shift_[w]>>SRlength[w]) & 0x01; 
	}	
    PULSIN_XOR;
      }//LR
    BITN_AND_OUT;
  }
  break;

/////////////////////from here we can't use ADCDACETC1 as we will vary the DAC but we need some macro - ADCONLY
// DAC back to 0 here

// 4x4 DAC modes
  /*
1-cycle and route 16 below
2-2x strobe=prob from below
3
4-4 bit shuffle
  
00 1-TM invert cycling bit - OR with BITIN (OR (routed^pulse)) // OR (routedORpulse) ??
01 2-BITIN or loopback
   [10 3-INV of above]
11 4- BITIN or not into cycling

what are the next 16x LR modes

  */
  
case 16:
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC
      ADCONLY(15, 0); // has gshift
      if (w==2){
      BINROUTEANDCYCLE; // TODO: substitute alt routes here for DAC. eg cycle, probability etc. 4x4 for 16-31 
    }
      else if (LR[w]) {
	BINROUTE; // TODO: fill in L and R modes here - BINROUTE is standard routings
	PULSIN_XOR;
      } 
      BITN_AND_OUT;
    }
break;

  case 17: 
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC
      ADCONLY(16,0); 
      if (w==2)      { // 1st trigger=prob 00 TM
	BINROUTE;
	if (trigger[w])	  bitrr=(shift_[w]>>SRlength[w]) & 0x01;
	else bitrr=!((shift_[w]>>SRlength[w]) & 0x01); 
	bitn|=bitrr;
      }
      else if (LR[w])
	{
	  //////////////////////////////////HERE!
	  BINROUTE; // TODO: fill in L and R modes here - BINROUTE is standard routings
	  /////////////////////////////////////...
	  PULSIN_XOR;
    } 
    BITN_AND_OUT;
  }
  break;

  case 18: //2nd trigger=prob 11 ENOTES 
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC
      ADCONLY(17, 0); // has gshift
      if (w==2){
	if (trigger[w]) tug[w]^=1;
	if (tug[w]){
	  BINROUTEANDCYCLE;
	}
	else {
	  bitn=(shift_[w]>>SRlength[w]) & 0x01; 
	}	
    }
      else if (LR[w]) {
	BINROUTE; // TODO: fill in L and R modes here - BINROUTE is standard routings
	PULSIN_XOR;
      } 
      BITN_AND_OUT;
    }
break;

  case 19: // trial 4 bit shuffle MODE
    if (counter[w]>speed[w] && speed[w]!=1024){
      dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC
      //      ADCONLY(16, 0); // has gshift - 4 bit mode matches 16
      // special mode for spaced entry so needs to be handled differently
      bitn=0;							
      dactype[2]=6;					       
    if (w==3) count=0;					
    GSHIFT;						
    if (w==0)						
  {							
    bitn=ADC_(0,SRlength[0],4,trigger[0],reggg,adcpar); // this is now adc mode 4
    if (mode[3]!=0){ /// no route in TESTY FIXED!
	if (SRlength[defroute[w]]>=SRlength[w]){ // need to >> 
	  //	  tmp=(SRlength[defroute[w]]>>2)-(SRlength[w]>>2); // /4
	  shift_[w]+=(((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][0])) >>(lastspac[SRlength[defroute[w]]][0]))+ \
		      ((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][1]))          >> ((lastspac[SRlength[defroute[w]]][1]) - spacc[SRlength[w]][0]))  + \
		      ((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][2]))         >>((lastspac[SRlength[defroute[w]]][2]) - spacc[SRlength[w]][1]))  + \
		      ((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][3]))         >>((lastspac[SRlength[defroute[w]]][3]) - spacc[SRlength[w]][2]))); 
	  }
	  else // shift up <<
	    {
	      shift_[w]+=(((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][0]))>>(lastspac[SRlength[defroute[w]]][0])) + \
			  ((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][1]))<< ((spacc[SRlength[w]][0]) - lastspac[SRlength[defroute[w]]][1]))  + \
			   ((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][2]))<< ((spacc[SRlength[w]][1]) - lastspac[SRlength[defroute[w]]][2]))  + \
			  ((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][3]))<< ((spacc[SRlength[w]][2]) - lastspac[SRlength[defroute[w]]][3])));
	    }
    }
  }							            
    else if (w==2){ // DAC out
      	shift_[w]&=spacmask[SRlength[w]]; //cleared
	
	if (SRlength[defroute[w]]>=SRlength[w]){ // need to >> 
	  //	  tmp=(SRlength[defroute[w]]>>2)-(SRlength[w]>>2); // /4
	  shift_[w]+=(((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][0])) >>(lastspac[SRlength[defroute[w]]][0]))+ \
		      ((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][1]))          >> ((lastspac[SRlength[defroute[w]]][1]) - spacc[SRlength[w]][0]))  + \
		      ((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][2]))         >>((lastspac[SRlength[defroute[w]]][2]) - spacc[SRlength[w]][1]))  + \
		      ((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][3]))         >>((lastspac[SRlength[defroute[w]]][3]) - spacc[SRlength[w]][2]))); 
	  }
	  else // shift up <<
	    {
	      shift_[w]+=(((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][0]))>>(lastspac[SRlength[defroute[w]]][0])) + \
			  ((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][1]))<< ((spacc[SRlength[w]][0]) - lastspac[SRlength[defroute[w]]][1]))  + \
			   ((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][2]))<< ((spacc[SRlength[w]][1]) - lastspac[SRlength[defroute[w]]][2]))  + \
			  ((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][3]))<< ((spacc[SRlength[w]][2]) - lastspac[SRlength[defroute[w]]][3])));
			  }
    } // w==2
      else if (LR[w]) { // we have 4 bit mode here to match
	shift_[w]&=spacmask[SRlength[w]]; //cleared
	
	if (SRlength[defroute[w]]>=SRlength[w]){ // need to >> 
	  //	  tmp=(SRlength[defroute[w]]>>2)-(SRlength[w]>>2); // /4
	  shift_[w]+=(((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][0])) >>(lastspac[SRlength[defroute[w]]][0]))+ \
		      ((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][1]))          >> ((lastspac[SRlength[defroute[w]]][1]) - spacc[SRlength[w]][0]))  + \
		      ((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][2]))         >>((lastspac[SRlength[defroute[w]]][2]) - spacc[SRlength[w]][1]))  + \
		      ((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][3]))         >>((lastspac[SRlength[defroute[w]]][3]) - spacc[SRlength[w]][2]))); 
	  }
	  else // shift up <<
	    {
	      shift_[w]+=(((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][0]))>>(lastspac[SRlength[defroute[w]]][0])) + \
			  ((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][1]))<< ((spacc[SRlength[w]][0]) - lastspac[SRlength[defroute[w]]][1]))  + \
			   ((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][2]))<< ((spacc[SRlength[w]][1]) - lastspac[SRlength[defroute[w]]][2]))  + \
			  ((shift_[defroute[w]]&(1<<lastspac[SRlength[defroute[w]]][3]))<< ((spacc[SRlength[w]][2]) - lastspac[SRlength[defroute[w]]][3])));
	    }
	PULSIN_XOR;
      }
    bitn=shift_[w]&1; // fixed this 29/12/2021
    shift_[w]+=bitn;				
    dac[w]=DAC_(w, SRlength[w], dactype[w],param[w],trigger[w]); 
    PULSOUT;
    }
break;

// DAC=1 - as above for next set of 3x4 DAC modes with LR modes to fill in
 
 
  

///////////////////////////////////////////////////////////   
  case 32:     // draft for CV+DAC and variations 0
    if (counter[w]>(speed[w]+dac[speedfrom_[w]])){ 
      dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC // adcpar=adc_buffer[lookupadc[w]] - 12 bits
      ADCDACETC1(0, 0);
      if (LR[w]){
      //////////////////////////////////HERE!
      BINROUTE; // TODO: fill in L and R modes here - BINROUTE is standard routings
      /////////////////////////////////////...
    PULSIN_XOR;
    } 
    BITN_AND_OUT;	
}
break;

