microresearch/allcolours/SR_segments/software/stm32f4xx_it_draftdec.c
case 33:     // draft for CV+DAC and variations 1
    tmpt=(dac[speedfrom_[w]]>>2)-(1024-speed[w]);
    if (tmpt<0) tmpt=0; 
    if (counter[w]>tmpt){
      dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC // adcpar=adc_buffer[lookupadc[w]] - 12 bits
      ADCDACETC1(0, 0);
      if (LR[w]){
      //////////////////////////////////HERE!
      BINROUTE; // TODO: fill in L and R modes here - BINROUTE is standard routings
      /////////////////////////////////////...
      PULSIN_XOR;
      } 
      BITN_AND_OUT;	
}
break;

    case 34:     // draft for CV+DAC and variations 2
      tmpt= speed[w]-(dac[speedfrom_[w]]>>2);
if (tmpt<0) tmpt=0; 
if (counter[w]>tmpt){
  dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC // adcpar=adc_buffer[lookupadc[w]] - 12 bits
      ADCDACETC1(0, 0);
      if (LR[w]){
      //////////////////////////////////HERE!
      BINROUTE; // TODO: fill in L and R modes here - BINROUTE is standard routings
      /////////////////////////////////////...
      PULSIN_XOR;
      } 
      BITN_AND_OUT;	
      }
      break;

case 35:     // draft for CV+DAC and variations 3
if (counter[w]>((dac[speedfrom_[w]]>>2)%speed[w])){ // wrap
  dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC // adcpar=adc_buffer[lookupadc[w]] - 12 bits
  ADCDACETC1(0, 0);
  if (LR[w]){
  //////////////////////////////////HERE!
  BINROUTE; // TODO: fill in L and R modes here - BINROUTE is standard routings
  /////////////////////////////////////...
PULSIN_XOR;
 } 
BITN_AND_OUT;	
}
break;

// draft for INTmodes
case 48:	
if (trigger[w]){ 
  dacpar=0; adcpar=param[0]; reggg=0; // params - reggg is for ADC // adcpar=adc_buffer[lookupadc[w]] - 12 bits
  param[w]=adc_buffer[lookupadc[w]]; //****
  ADCDACETC1(0, 0);
  if (LR[w]){
  //////////////////////////////////HERE!
  BINROUTE; // TODO: fill in L and R modes here - BINROUTE is standard routings
  /////////////////////////////////////...
PULSIN_XOR;
 } 
BITN_AND_OUT;
}
break;

  case 121: // test case for DAC thru...
    if (counter[w]>speed[w] && speed[w]!=1024){
      counter[w]=0;
      // test 1 bit audio straight through
      k=(adc_buffer[12]); // from 0 to 4095 but where is the middle?
      //      k=0;
    integrator+=(k-oldValue);
   if(integrator>2048)
  {
     oldValue=4095;
     bt=1;
  }
   else
   {
      oldValue=0;
      bt=0;
   }   

   dac[2]=oldValue;
    }
    break;
 
    ///////////////////////////////////////////////////////////////////////// 
} // switch

  //  dac[2]=4095;
    if (w==2)  {
    DAC_SetChannel1Data(DAC_Align_12b_R, 4095-dac[2]); // 1000/4096 * 3V3 == 0V8 
    int j = DAC_GetDataOutputValue (DAC_Channel_1); // DACout is inverting  
          }


      // DAC for normed NSR/PWM
  if (w==3){
      tmp= dac[3]; // right hand
      tmp+=320; 
      TIM1->ARR =tmp; // what range this should be? - connect to SRlengthc
      TIM1->CCR1 = tmp/2; // pulse width

      // TESTY with INTmodes
      
      // fake CLKINs for L,R,C are from Cspeed==2 - this needs to be in speeds then but...
      // or we can set L and R from an independent SR with only CSR as clocked from here
      // then we would need 5,6 counters and more flippers... TRIAL

      if (counter[5]>dac[3]){ // L side
	counter[5]=0;
	flipper[0]^=1;
	if (flipper[0]) GPIOB->BSRRH = clk_route[1];  // clear bits of fake_one - clkr is 7 so all of them - was clkr=7 // all of them
	else   GPIOB->BSRRL=clk_route[1]; //  write bits
      }      

      if (counter[6]>dac[1]){ // R side
	counter[6]=0;
	flipper[1]^=1;
	if (flipper[1]) GPIOB->BSRRH = clk_route[2];  // clear bits of fake_one - clkr is 7 so all of them - was clkr=7 // all of them
	else   GPIOB->BSRRL=clk_route[2]; //  write bits
      }      
      
      //      if (counter[4]>(speed[2]>>1)){ // changed to >>1 or freezes some strobe modes so is x2 speed
      if (counter[4]>(dac[3])){ // now trying DAC 29/12/2021
	counter[4]=0;
	flipper[2]^=1;
	if (flipper[2]) GPIOB->BSRRH = clk_route[4];  // clear bits of fake_one - clkr is 7 so all of them - was clkr=7 // all of them
	else   GPIOB->BSRRL=clk_route[4]; //  write bits
  }
      counter[4]++; counter[5]++; counter[6]++;

  }
}
